src/DataProcessors/ПомощникПроведенияОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПроведенияОплаты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СтатусыОплатыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОплатыЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействияСсылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторQRКода</Name>
					<Comment>Для АльфаБанка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдЗаказа</Name>
					<Comment>ID в системе банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеСтатуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовОнлайнОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСсылкиНаОплату</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСсылокНаОплату</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ПлатежныеШлюзы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПлатежныеШлюзы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сбербанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбербанкПлатиQR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПАльфаБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПРайффайзенБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПСбербанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПСДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПТинькофф</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаказовОнлайнОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовОнлайнОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Истекший</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетВозврата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПречековыйПринтер</Name>
					<Comment>BeforeCheckPrinters</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>API</Name>
					<Comment>API</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ПомощникПроведенияОплаты/Forms/ФормаОтправкиПлатежейСБП/Ext/Form/Module.bsl
#Область Переменные

&НаКлиенте
Перем ИзмененТекстСообщения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЭквайринговыйТерминал"	, ЭтотОбъект.ЭквайринговыйТерминал);
	Параметры.Свойство("НомерЗаказа"			, ЭтотОбъект.НомерЗаказа);
	Параметры.Свойство("СуммаОплаты"			, ЭтотОбъект.СуммаОплаты);	
	Параметры.Свойство("КассаОплаты"			, ЭтотОбъект.КассаОплаты);
	Параметры.Свойство("Контрагент"    			, ЭтотОбъект.Контрагент);
	Параметры.Свойство("СтруктурнаяЕдиница"		, ЭтотОбъект.СтруктурнаяЕдиница);		
	Параметры.Свойство("Организация"			, ЭтотОбъект.Организация);
	
	ЭтотОбъект.Организация = ?(Не ЗначениеЗаполнено(ЭтотОбъект.Организация), СтруктурнаяЕдиница.Организация, ЭтотОбъект.Организация);  
	
	Если Параметры.Свойство("МассивЗадолженностей") Тогда		
		
		СуммаОплатыПередана = ЗначениеЗаполнено(ЭтотОбъект.СуммаОплаты);
		СуммаВрем			= ЭтотОбъект.СуммаОплаты;	
		
		Для Каждого СтрокаМ Из Параметры.МассивЗадолженностей Цикл
			
			Если СуммаОплатыПередана И СуммаВрем <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			НоваяСтрока = ЭтотОбъект.ТаблицаЗадолженностей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМ);
			
			Если СуммаОплатыПередана Тогда
				НоваяСтрока.Задолженность = ?(СтрокаМ.Задолженность > СуммаВрем, СуммаВрем, СтрокаМ.Задолженность);
				СуммаВрем = СуммаВрем - НоваяСтрока.Задолженность;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПолучитьНеоплаченнуюСсылкуНаОплату();		
	ЗаполнитьСервисыРассылки();
	ЗаполнитьТребуемыеПараметрыПШ();
	ОбновитьQRКод();
	ОбновитьЭлементыФормы();
	
	МассивПО = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам("ДисплейПокупателя");
	
	Если МассивПО.Количество() > 0 Тогда
		ЭтотОбъект.ПодключаемоеОборудование = МассивПО[0].Ссылка;	
	КонецЕсли;
	
	ЭтаФорма.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		
		Элементы.ГруппаСкопироватьВБуфер.Видимость = Ложь;
		Элементы.СкопироватьСсылкуВБуфер.Видимость = Ложь;
		
	#Иначе
		
		ЭтоWindowsКлиент = ОбщегоНазначенияКлиентСервер.ЭтоWindowsКлиент();
		
		Элементы.ГруппаСкопироватьВБуфер.Видимость = ЭтоWindowsКлиент;
		Элементы.СкопироватьСсылкуВБуфер.Видимость = ЭтоWindowsКлиент;
		
	#КонецЕсли
	
	ВывестиQrКодНаМонитор();
	
КонецПроцедуры

&НаКлиенте
// Процедура - При закрытии
//
// Параметры:
//  ЗавершениеРаботы - 	 - 
//
Процедура ПриЗакрытии(ЗавершениеРаботы)
		
	Попытка
		ОчиститьQrНаМониторе(); // чисто клиенские вызовы, но на всякий пусть будет попытка
	Исключение
	КонецПопытки;
	
	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЭквайринговыйТерминал) И ИзмененТекстСообщения = Истина Тогда		
		ЗаписатьПараметрыПШ(ЭквайринговыйТерминал, ШаблонДляОтправкиСсылкиНаОплату);						
	КонецЕсли;
	
	Если ОбновитьИнформациюОСсылкахНаОплату = Истина Тогда
		МассивЗадолженностей = Новый Массив;
		Для Каждого СтрокаТ Из ЭтотОбъект.ТаблицаЗадолженностей Цикл
			МассивЗадолженностей.Добавить(СтрокаТ.ДокументЗадолженности);	
		КонецЦикла;		
		Оповестить("ОбновитьИнформациюОСсылкахНаОплату", МассивЗадолженностей);			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
// Процедура - Обновить элементы формы
//
Процедура ОбновитьЭлементыФормы()
		
	ЭтаФорма.Заголовок				= Строка(ЭквайринговыйТерминал.ТипБанка) + ", " + ЭквайринговыйТерминал.Наименование;
	СсылкаСоздана					= ЗначениеЗаполнено(ЭтотОбъект.СсылкаНаОплату);
	Элементы.СуммаОплаты.Заголовок 	= "Сумма оплаты: " + Формат(ЭтотОбъект.СуммаОплаты, "ЧДЦ=2; ЧН=0,00") + " " + СокрЛП(ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()); 	
	
	Элементы.ГруппаСсылкаНаОплату.Видимость							= СсылкаСоздана;
	Элементы.СформироватьСсылкуНаОплатуСВыбраннойСуммой.Заголовок 	= ?(СсылкаСоздана, "Отправить", "Сгенерировать");  
	Элементы.ГруппаВремяДействия.Видимость							= СсылкаСоздана;
	
	Элементы.ГруппаСформирован.Видимость 	= ЗначениеЗаполнено(ЭтотОбъект.ВремяСформирован);
	Элементы.СформированДата.Заголовок		= Формат(ЭтотОбъект.ВремяСформирован,"ДФ='dd.MM.yyyy ЧЧ:мм'");
	
	Элементы.ГруппаДействителенДо.Видимость	= ЗначениеЗаполнено(ЭтотОбъект.ВремяДействителенДо);
	Элементы.ДействителенДоДата.Заголовок	= Формат(ЭтотОбъект.ВремяДействителенДо,"ДФ='dd.MM.yyyy ЧЧ:мм'");
	
	МассивПлатежныхШлюзов = Новый Массив;
	МассивПлатежныхШлюзов.Добавить(Перечисления.ПлатежныеШлюзы.СБПСбербанк);
	МассивПлатежныхШлюзов.Добавить(Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR);
	МассивПлатежныхШлюзов.Добавить(Перечисления.ПлатежныеШлюзы.СБПАльфабанк);
	МассивПлатежныхШлюзов.Добавить(Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк);
	МассивПлатежныхШлюзов.Добавить(Перечисления.ПлатежныеШлюзы.СБПСДМ);
	МассивПлатежныхШлюзов.Добавить(Перечисления.ПлатежныеШлюзы.СБПТинькофф); 
	
	Элементы.ПроверитьСтатус.Видимость = СсылкаСоздана И МассивПлатежныхШлюзов.Найти(ЭквайринговыйТерминал.ТипБанка) <> Неопределено;
	
	УстановитьВидимостьЭлементовРедактированияШаблона(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СформироватьСсылкуНаОплатуСВыбраннойСуммой".
//
Процедура СформироватьСсылкуНаОплатуСВыбраннойСуммой(Команда)
	
	СсылкаУжеПолучена = ЗначениеЗаполнено(ЭтотОбъект.СсылкаНаОплату);
	
	Если Не СсылкаУжеПолучена Тогда				
		СформироватьСсылкуНаОплатуСервер();
		ВывестиQrКодНаМонитор();
	Иначе		
		РазослатьСсылку();								
	КонецЕсли;
	
	Если ЭтотОбъект.СкопироватьВБуферОбмена Тогда
		СкопироватьСсылкуОплатыВБуфер(ЭтотОбъект.СсылкаНаОплату);	
	КонецЕсли;
	
	Если СсылкаУжеПолучена Тогда
		ЗакрытьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Сформировать ссылку на оплату сервер
// 
// Возвращаемое значение:
//   - 
//
Процедура СформироватьСсылкуНаОплатуСервер()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	СтруктураПараметров.Вставить("КассаОплаты"			, КассаОплаты);
	СтруктураПараметров.Вставить("Контрагент"			, Контрагент);
	СтруктураПараметров.Вставить("Организация"			, Организация);
	СтруктураПараметров.Вставить("СуммаОплаты"			, СуммаОплаты);
	СтруктураПараметров.Вставить("ТаблицаЗадолженностей", ТаблицаЗадолженностей);
	СтруктураПараметров.Вставить("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	СтруктураПараметров.Вставить("НомерТелефона"		, НомерТелефона);
	СтруктураПараметров.Вставить("АдресЭПКонтрагента"	, АдресЭП);
	
	Результат = СсылкиНаОплатуИСБП.СформироватьСсылкуНаОплату(СтруктураПараметров);
	
	Если Результат.ВыполненоУспешно Тогда
		
		ВремяСформирован 	= ТекущаяДатаСеанса();
		ВремяДействителенДо = Результат.ВремяДействителенДо;
		СсылкаНаОплату	 	= Результат.СсылкаНаОплату;
		НомерЗаказа	 		= Результат.НомерЗаказа;
		ДанныеQRКода	 	= УправлениеПечатью.ДанныеQRКода(Результат.СсылкаНаОплату, 0, 200);
		
		Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда			
			QRКод = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
		КонецЕсли;
		ОбновитьЭлементыФормы();
		
		ОбновитьИнформациюОСсылкахНаОплату = Истина;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "Отмена".
//
Процедура Отмена(Команда)
	
	ЗакрытьФорму(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отменить ссылку на оплату
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОтменитьСсылкуНаОплату(Команда)
	
	ТекстВопроса = НСтр("ru='Отмена ссылки приведет к невозможности автоматической оплаты по этой ссылке.
							|Продолжить?';
						|en='Cancellation of the link will result in the inability to automatically pay for this link.
							|Continue?'");

	ЗаголовокВопроса = НСтр("ru='Внимание!';en='Attention!'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьСсылкуНаОплатуЗавершение", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отменить ссылку на оплату завершение
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ОтменитьСсылкуНаОплатуЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да И ЗначениеЗаполнено(ЭтотОбъект.СсылкаНаОплату) Тогда
		
		Результат = ОтменитьСсылкуНаОплатуСервер();
		
		Если Результат.ВыполненоУспешно Тогда
			ОбновитьИнформациюОСсылкахНаОплату = Истина;
			ЗакрытьФорму(Истина);
		Иначе		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Отменить ссылку на оплату сервер
//
// Параметры:
//  СсылкаНаОплату	 - 	 - 
//
Функция ОтменитьСсылкуНаОплатуСервер()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТаблицаЗадолженностей", ТаблицаЗадолженностей);
	СтруктураПараметров.Вставить("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	СтруктураПараметров.Вставить("СсылкаНаОплату"		, СсылкаНаОплату);
	СтруктураПараметров.Вставить("НомерЗаказа"			, НомерЗаказа);

	//СтруктураПараметров.Вставить("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	//СтруктураПараметров.Вставить("КассаОплаты"			, КассаОплаты);
	//СтруктураПараметров.Вставить("Контрагент"			, Контрагент);
	//СтруктураПараметров.Вставить("Организация"			, Организация);
	//СтруктураПараметров.Вставить("СуммаОплаты"			, СуммаОплаты);
	//СтруктураПараметров.Вставить("НомерТелефона"		, НомерТелефона);
	//СтруктураПараметров.Вставить("АдресЭПКонтрагента"	, АдресЭП);
	
	Возврат СсылкиНаОплатуИСБП.ОтменитьСсылкуНаОплату(СтруктураПараметров);
					
КонецФункции

&НаКлиенте
// Процедура, обработчик события "СкопироватьСсылкуВБуфер".
//
Процедура СкопироватьСсылкуВБуфер(Команда)
	
	СкопироватьСсылкуОПлатыВБуфер(ЭтотОбъект.СсылкаНаОплату);
	
КонецПроцедуры

&НаКлиенте                                                         
// Процедура, копирует ссылку оплаты в буфер.
//
Процедура СкопироватьСсылкуОПлатыВБуфер(СсылкаОплаты)
	
	ОбъектHtml = Новый COMОбъект("htmlfile");
	ОбъектHtml.ParentWindow.ClipboardData.Setdata("Text", СсылкаОплаты);  
	ПоказатьОповещениеПользователя("Внимание", ,"Ссылка на оплату скопирована в буфер обмена. " + СсылкаОплаты, БиблиотекаКартинок.КопированиеСтрок);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Рассылка

&НаСервере
// Процедура, заполняет сервисы рассылки.
//
Процедура ЗаполнитьСервисыРассылки()
	
	ЭтотОбъект.НомерТелефона 	= ПолучитьКонтактныеДанныеКонтрагента("Телефон");
	ЭтотОбъект.АдресЭП			= ПолучитьКонтактныеДанныеКонтрагента("АдресЭлектроннойПочты");
	
	ВнешняяСистемаМессенджер	= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.GreenApi);
	//ВнешняяСистемаМобПриложение	= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.МобильноеПриложениеКлиента);
		
	Элементы.ГруппаМессенджер.Видимость	= ЗначениеЗаполнено(ВнешняяСистемаМессенджер) И ЗначениеЗаполнено(НомерТелефона);
	Элементы.ГруппаEmail.Видимость		= ЗначениеЗаполнено(ЭтотОбъект.АдресЭП) И ПроверитьВозможностьИспользованияEmailРассылки();
	Элементы.ГруппаSMS.Видимость		= ЗначениеЗаполнено(НомерТелефона) И ПроверитьВозможностьИспользованияSMSРассылки();
	//Элементы.ГруппаPush.Видимость		= ЗначениеЗаполнено(ВнешняяСистемаМобПриложение) И ЗначениеЗаполнено(НомерТелефона) И РегистрыСведений.КлючиВнешнихСистем.КонтрагентЗарегистрированДляВнешнейСистемы(Контрагент, Перечисления.ТипыВнешнихСистем.МобильноеПриложениеКлиента);
		
КонецПроцедуры

&НаСервере
// Функция, проверяет возможность использования sms рассылки.
//
Функция ПроверитьВозможностьИспользованияSMSРассылки()
	
	СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	
	Если Не ЗначениеЗаполнено(СервисSMSРассылки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	БалансАккаунтаSMS = Справочники.СервисыРассылки.ПолучитьБалансАккаунтаSMS(СервисSMSРассылки);
	
	Возврат БалансАккаунтаSMS.Ошибка = Ложь И ТипЗнч(БалансАккаунтаSMS.Баланс) = Тип("Число") И БалансАккаунтаSMS.Баланс > 0;
	
КонецФункции

&НаСервере
// Функция, проверяет возможность использования eamil рассылки.
//
Функция ПроверитьВозможностьИспользованияEmailРассылки()

	ДоступныеУчетныеЗаписи = Новый СписокЗначений;
	УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписиДляОтправки(ДоступныеУчетныеЗаписи);
	
	УчетнаяЗапись = ?(ДоступныеУчетныеЗаписи.Количество() > 0, ДоступныеУчетныеЗаписи[0].Значение, Неопределено);		
	
	Возврат ЗначениеЗаполнено(УчетнаяЗапись);
	
КонецФункции

&НаСервере
// Процедура, возвращает номера телефонов контрагентов.
//
Функция ПолучитьКонтактныеДанныеКонтрагента(ТипКонтактнойИнформации)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	&ВыбираемоеПоле КАК Контакт
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
	|	И НЕ КонтактнаяИнформация.НеУчаствоватьВРассылке");
	
	Запрос.УстановитьПараметр("Контрагент"				, ЭтотОбъект.Контрагент);
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации" , Перечисления.ТипыКонтактнойИнформации[ТипКонтактнойИнформации]);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВыбираемоеПоле", ?(ТипКонтактнойИнформации = "АдресЭлектроннойПочты", "КонтактнаяИнформация.Представление", "КонтактнаяИнформация.НомерТелефона"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Контакт, Неопределено);
	
КонецФункции

&НаСервере
// Процедура, отправляет ссылку на установку карты.
//
Процедура РазослатьСсылку()
		
	Если ЭтотОбъект.ОтправитьВМессенджер Тогда
		ОтправитьСсылкуНаОплатуНаСервере("Мессенджер", ЭтотОбъект.СсылкаНаОплату);	
	КонецЕсли;
	
	Если ЭтотОбъект.ОтправитьПоSMS Тогда
		ОтправитьСсылкуНаОплатуНаСервере("SMS", ЭтотОбъект.СсылкаНаОплату);
	КонецЕсли;
	
	Если ЭтотОбъект.ОтправитьPushУведомлением Тогда
		ОтправитьСсылкуНаОплатуНаСервере("Push", ЭтотОбъект.СсылкаНаОплату);
	КонецЕсли;
	
	Если ЭтотОбъект.ОтправитьПоEmail Тогда
		ОтправитьСообщениеEmailНаСервере(ЭтотОбъект.СсылкаНаОплату);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, отправляет ссылку на установку карты.
//
Процедура ОтправитьСсылкуНаОплатуНаСервере(СервисРассылки, СсылкаНаОплату)
			
	ПолучателиСообщения = Новый Массив();
	ПолучателиСообщения.Добавить(Новый Структура("Получатель", ЭтотОбъект.Контрагент));
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"         , ПолучателиСообщения);
	ПараметрыРассылки.Вставить("Содержание"         , ПолучитьСодержаниеСообщения());
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница" , ЭтотОбъект.СтруктурнаяЕдиница);
	
	Если СервисРассылки = "SMS" Тогда
		ПараметрыРассылки.Вставить("ОтправкаSMS", Истина);
	КонецЕсли;
	
	Если СервисРассылки = "Мессенджер" Тогда
		ПараметрыРассылки.Вставить("ОтправкаMessenger"	 , Истина);
		ПараметрыРассылки.Вставить("ИнициироватьОтправку", Истина);
	КонецЕсли;
	
	Если СервисРассылки = "Push" Тогда
		ПараметрыРассылки.Вставить("ОтправкаPush", Истина);
	КонецЕсли;
	
	ПараметрыРассылки.Вставить("ОтправитьНемедленно", Истина);
	
	ОписаниеОшибки = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//Процедура, отправляет сообщение email.
//
Процедура ОтправитьСообщениеEmailНаСервере(СсылкаНаОплату)
	
	ОписаниеОшибки = "";
	
	СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(
		ЭтотОбъект.Контрагент, 
		ЭтотОбъект.АдресЭП,
		"Оплата по ссылке",
		ПолучитьСодержаниеСообщения(),
		Неопределено,
		ОписаниеОшибки
	);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Создать документ исходящее письмо отправить письмо на сервере.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  Тема						 - 	 -
//  ОписаниеОшибки				 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Контакт, Адрес, Тема, Содержание, Сделка, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	МассивСтруктурПолучателей.Добавить(Новый Структура("Контакт, Адрес", Контакт, Адрес));
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата"             , ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("Тема"             , Тема);
	ДанныеЗаполнения.Вставить("Тело"             , Содержание);
	ДанныеЗаполнения.Вставить("МассивПолучателей", МассивСтруктурПолучателей);
	ДанныеЗаполнения.Вставить("Сделка"           , Сделка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсходящееЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Заполнить(ДанныеЗаполнения);
	
	Возврат Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ИсходящееЭлектронноеПисьмо, ОписаниеОшибки);
	
КонецФункции

#КонецОбласти

&НаСервере
// Функция, возвращает неоплаченную ссылку на оплату.
//
Процедура ПолучитьНеоплаченнуюСсылкуНаОплату()
		
	ДокументыЗадолженности = Неопределено;
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
		ТаблицаВыбранныхДокументов	= ТаблицаЗадолженностей.Выгрузить(, "ДокументЗадолженности");
		ДокументыЗадолженности		= ТаблицаВыбранныхДокументов.ВыгрузитьКолонку("ДокументЗадолженности");		
	КонецЕсли;
	
	ТаблицаЗаказов = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьНеОплаченныеЗаказыПоДокументу(ДокументыЗадолженности, НомерЗаказа, ЭквайринговыйТерминал);
	
	Если ТаблицаЗаказов.Количество() > 0 И ЗначениеЗаполнено(ТаблицаЗаказов[0].СсылкаОплаты) Тогда
		
		ТаблицаЗадолженностей.Очистить();
		
		Для Каждого СтрокаТ Из ТаблицаЗаказов Цикл
			НоваяСтрока = ТаблицаЗадолженностей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТ);	
		КонецЦикла;
		
		ВремяСформирован		= СтрокаТ.ДатаРегистрацииЗаказа; 
		ВремяДействителенДо 	= СтрокаТ.ДатаОкончанияДействияСсылки;
		НомерЗаказа		    	= СтрокаТ.НомерЗаказа;
		Контрагент				= СтрокаТ.Контрагент; 
		СтруктурнаяЕдиница		= СтрокаТ.СтруктурнаяЕдиница;
		ЭквайринговыйТерминал	= СтрокаТ.ЭквайринговыйТерминал;
		СуммаОплаты				= ТаблицаЗадолженностей.Итог("Задолженность");
		СсылкаНаОплату			= СтрокаТ.СсылкаОплаты;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить QRКод
//
Процедура ОбновитьQRКод()
	
	Если Не ЗначениеЗаполнено(СсылкаНаОплату) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(СсылкаНаОплату, 0, 200);
	
	Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда			
		QRКод = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
// Функция - Проверить статус на сервере
//
// Параметры:
//  НомерЗаказа	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьСтатусНаСервере(НомерЗаказа)
	
	РезультатЗапроса = Неопределено;
	РегламентныеЗаданияСерверСтоматология.ОбработатьНеОплаченныеЗаказыСБП(НомерЗаказа, РезультатЗапроса);
	ВыборкаЗаказа = РегистрыСведений.СтатусыОплатыЗаказов.ПолучитьВыборкуЗаказаПоНомеру(НомерЗаказа);
	
	РезультатЗапроса.Вставить("Статус", ?(ВыборкаЗаказа <> Неопределено, ВыборкаЗаказа.Статус, Неопределено));
	
	Возврат РезультатЗапроса;
		
КонецФункции

&НаКлиенте
// Процедура - Проверить статус
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПроверитьСтатус(Команда)
	
	РезультатЗапроса = ПроверитьСтатусНаСервере(НомерЗаказа);
	ЗаказОплачен	 = РезультатЗапроса.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовОнлайнОплаты.Оплачено");
	ЗаказОтклонен	 = РезультатЗапроса.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовОнлайнОплаты.Отказ");
	
	Если ЗаказОплачен Тогда
		
		СообщениеПользователю = "Заказ успешно оплачен";
		
	ИначеЕсли ЗаказОтклонен Тогда
		
		СообщениеПользователю = "Заказ отклонен";
		
	ИначеЕсли РезультатЗапроса.ВыполненоУспешно = Ложь И ЗначениеЗаполнено(РезультатЗапроса.ОписаниеОшибки) Тогда 
		
		СообщениеПользователю = РезультатЗапроса.ОписаниеОшибки;
		
	Иначе
		
		СообщениеПользователю = "Заказ ожидает оплаты";
		
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
	
	Если ЗаказОплачен ИЛИ ЗаказОтклонен Тогда
		ОбновитьИнформациюОСсылкахНаОплату = Истина;
		ЗакрытьФорму();
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
// Процедура - Закрыть форму
//
Процедура ЗакрытьФорму(ОтменаСсылки = Ложь)
	 ЭтаФорма.Закрыть(Новый Структура("ОбновитьИнформациюОСсылкахНаОплату, ОтменаСсылки", ОбновитьИнформациюОСсылкахНаОплату, ОтменаСсылки));	
КонецПроцедуры

&НаСервере
// Функция - Получить содержание сообщения
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСодержаниеСообщения()
	
	СодержаниеСообщения = ШаблонДляОтправкиСсылкиНаОплату;
	
	СодержаниеСообщения = СтрЗаменить(СодержаниеСообщения, "{СсылкаНаОплату}"		, СсылкаНаОплату);
	СодержаниеСообщения = СтрЗаменить(СодержаниеСообщения, "{ПредставлениеКлиента}"	, ОбщегоНазначения.ПолучитьЗначениеРеквизита(Контрагент, "Наименование"));
	СодержаниеСообщения = СтрЗаменить(СодержаниеСообщения, "{ПредставлениеКлуба}"	, ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "Наименование"));
	СодержаниеСообщения = СтрЗаменить(СодержаниеСообщения, "{СуммаОплаты}"			, СуммаОплаты);
	СодержаниеСообщения = СтрЗаменить(СодержаниеСообщения, "{ВремяОкончанияСсылки}"	, ?(ЗначениеЗаполнено(ВремяДействителенДо), Формат(ЭтотОбъект.ВремяДействителенДо,"ДФ='dd.MM.yyyy ЧЧ:мм'"), ""));
	
	Возврат СодержаниеСообщения;
	
КонецФункции

&НаКлиенте
// Функция - Вывести qr код на монитор
// 
// Возвращаемое значение:
//   - 
//
Процедура ВывестиQrКодНаМонитор()
	
	Если Не ЗначениеЗаполнено(СсылкаНаОплату) ИЛИ Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодключенияОборудования", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, ЭтаФорма.УникальныйИдентификатор, ПодключаемоеОборудование);		
		
КонецПроцедуры

&НаКлиенте
// Процедура - После подключения оборудования
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ПослеПодключенияОборудования(РезультатПодключения, ДопПараметры) Экспорт
	
	ПодключенныеУстройства = МенеджерОборудованияКлиент.ПолучитьПодключенныеУстройства(глПодключаемоеОборудование.ПараметрыПодключенияПО, ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ДисплейПокупателя"), ПодключаемоеОборудование);
	
	Если РезультатПодключения.Свойство("Результат") И РезультатПодключения.Результат = Истина Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыводаНаМонитор", ЭтотОбъект);
		ВыходныеПараметры = Новый Структура("ЗначениеQRКода, ИдентификаторКлиента, Команда", СсылкаНаОплату, ЭтаФорма.УникальныйИдентификатор, "DisplayQRCode");		
		МенеджерОборудованияКлиент.НачатьВыводQRКодаНаДисплейПокупателя(ОписаниеОповещения, ЭтаФорма.УникальныйИдентификатор, ПодключаемоеОборудование, ВыходныеПараметры);
	Иначе		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось подключить устройство. " + РезультатПодключения.ОписаниеОшибки);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - После вывода на монитор
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ПослеВыводаНаМонитор(РезультатВывода, ДопПараметры) Экспорт
	
	Если РезультатВывода.Свойство("Результат") И РезультатВывода.Результат = Ложь Тогда
		
		ДопОписаниеОшибки = "";
		Если ТипЗнч(РезультатВывода.ВыходныеПараметры) = Тип("Структура") И РезультатВывода.ВыходныеПараметры.Свойство("ОписаниеОшибки") Тогда
			ДопОписаниеОшибки = РезультатВывода.ВыходныеПараметры.ОписаниеОшибки	
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось вывести QR. " + ДопОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция - Очистить qr на мониторе
// 
// Возвращаемое значение:
//   - 
//
Процедура ОчиститьQrНаМониторе()	
	
	Если Не ЗначениеЗаполнено(СсылкаНаОплату) ИЛИ Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерОборудованияКлиент.НачатьОчисткуДисплеяПокупателя(Неопределено, ЭтаФорма.УникальныйИдентификатор, ПодключаемоеОборудование);
	
КонецПроцедуры

&НаКлиенте
// Процедура - При изменении тумблера отправки
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПриИзмененииТумблераОтправки(Элемент)
	УстановитьВидимостьЭлементовРедактированияШаблона(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура - Установить видимость элементов редактирования шаблона
//
Процедура УстановитьВидимостьЭлементовРедактированияШаблона(Форма)
	
	Форма.Элементы.РедактироватьШаблонСообщенияМессенджер.Видимость	= Форма.ЭтотОбъект.ОтправитьВМессенджер;
	Форма.Элементы.РедактироватьШаблонСообщенияPush.Видимость		= Форма.ЭтотОбъект.ОтправитьPushУведомлением;
	Форма.Элементы.РедактироватьШаблонСообщенияEmail.Видимость		= Форма.ЭтотОбъект.ОтправитьПоEmail;
	Форма.Элементы.РедактироватьШаблонСообщенияСМС.Видимость		= Форма.ЭтотОбъект.ОтправитьПоSMS;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Редактировать шаблон сообщения
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура РедактироватьШаблонСообщения(Элемент)
	
	Если Не ЗначениеЗаполнено(СсылкаНаОплату) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сперва необходимо сгенерировать ссылку на оплату");
		Возврат;
	КонецЕсли;
	
	ПараметрыСтруктурой = Новый Структура("ШаблонДляОтправкиСсылкиНаОплату", ШаблонДляОтправкиСсылкиНаОплату);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРедактированияШаблонаСообщения", ЭтотОбъект);	
	ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаРедактированияШаблонаСообщения", ПараметрыСтруктурой,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После редактирования шаблона сообщения
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ПослеРедактированияШаблонаСообщения(Результат, ДопПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("ШаблонДляОтправкиСсылкиНаОплату") 
		И ЭтотОбъект.ШаблонДляОтправкиСсылкиНаОплату <> Результат.ШаблонДляОтправкиСсылкиНаОплату Тогда
		
		ЭтотОбъект.ШаблонДляОтправкиСсылкиНаОплату = Результат.ШаблонДляОтправкиСсылкиНаОплату;
		ИзмененТекстСообщения = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить требуемые параметры ПШ
//
Процедура ЗаполнитьТребуемыеПараметрыПШ()
	
	ПараметрыПШ = ЭтотОбъект.ЭквайринговыйТерминал.ПараметрыПлатежногоШлюза.Получить();
	
	Если ТипЗнч(ПараметрыПШ) = Тип("Структура") И ПараметрыПШ.Свойство("ШаблонДляОтправкиСсылкиНаОплату") Тогда
		ЭтотОбъект.ШаблонДляОтправкиСсылкиНаОплату = ПараметрыПШ.ШаблонДляОтправкиСсылкиНаОплату;
	Иначе
		ЭтотОбъект.ШаблонДляОтправкиСсылкиНаОплату = "Ссылка на оплату: {СсылкаНаОплату}";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Записать параметры ПШ
//
// Параметры:
//  ЭквайринговыйТерминал			 - 	 - 
//  ШаблонДляОтправкиСсылкиНаОплату	 - 	 - 
//
Процедура ЗаписатьПараметрыПШ(ЭквайринговыйТерминал, ШаблонДляОтправкиСсылкиНаОплату)
	
	ОбъектЭТ = ЭквайринговыйТерминал.ПолучитьОбъект();
	
	Если ОбъектЭТ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПШ = ОбъектЭТ.ПараметрыПлатежногоШлюза.Получить();
	
	Если ПараметрыПШ = Неопределено Тогда
		ПараметрыПШ = Новый Структура();
	КонецЕсли;

	ПараметрыПШ.Вставить("ШаблонДляОтправкиСсылкиНаОплату", ШаблонДляОтправкиСсылкиНаОплату);
	
	ОбъектЭТ.ПараметрыПлатежногоШлюза = Новый ХранилищеЗначения(ПараметрыПШ);

	Попытка
		ОбъектЭТ.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
